import SliderFirst from './SliderFirst';
import SliderSecond from './SliderSecond';
import picture from "../images/picture1.jpeg";


const topicsData=[
  {
    name: 'firstSection',
    top: [
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "1 from data從台灣到矽谷、中東她們推動全球女性職涯發展全球女性職涯發展全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的Arabic創辦人蕭潔蓮，還是大五的學生，為了實踐夢想遠走陌生異鄉。即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "2從台灣到矽谷、中東她們推動全球女性職涯發展全球女性職涯發展全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的Arabic創辦人蕭潔蓮，還是大五的學生，為了實踐夢想遠走陌生異鄉。即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "3從台灣到矽谷、中東她們推動全球女性職涯發展全球女性職涯發展全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的Arabic創辦人蕭潔蓮，還是大五的學生，為了實踐夢想遠走陌生異鄉。即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
    ],
    bottom: [
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "L1從台灣到矽谷、中東她們推動全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "L2從台灣到矽谷、中東她們推動全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "L3從台灣到矽谷、中東她們推動全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
    ],
  },
  {
    name: 'secondSection',
    top: [
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "1從台灣到矽谷、中東她們推動全球女性職涯發展全球女性職涯發展全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的Arabic創辦人蕭潔蓮，還是大五的學生，為了實踐夢想遠走陌生異鄉。即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "2從台灣到矽谷、中東她們推動全球女性職涯發展全球女性職涯發展全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的Arabic創辦人蕭潔蓮，還是大五的學生，為了實踐夢想遠走陌生異鄉。即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "3從台灣到矽谷、中東她們推動全球女性職涯發展全球女性職涯發展全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的Arabic創辦人蕭潔蓮，還是大五的學生，為了實踐夢想遠走陌生異鄉。即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
    ],
    bottom: [
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "L1從台灣到矽谷、中東她們推動全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "L2從台灣到矽谷、中東她們推動全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "L3從台灣到矽谷、中東她們推動全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
    ],
  },
  {
    name: 'thirdSection',
    top: [
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "1從台灣到矽谷、中東她們推動全球女性職涯發展全球女性職涯發展全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的Arabic創辦人蕭潔蓮，還是大五的學生，為了實踐夢想遠走陌生異鄉。即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "2從台灣到矽谷、中東她們推動全球女性職涯發展全球女性職涯發展全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的Arabic創辦人蕭潔蓮，還是大五的學生，為了實踐夢想遠走陌生異鄉。即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "3從台灣到矽谷、中東她們推動全球女性職涯發展全球女性職涯發展全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的Arabic創辦人蕭潔蓮，還是大五的學生，為了實踐夢想遠走陌生異鄉。即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
    ],
    bottom: [
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "L1從台灣到矽谷、中東她們推動全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "L2從台灣到矽谷、中東她們推動全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
      {
        image: picture,
        link:
          "https://www.businesstoday.com.tw/article/category/183027/post/202009100038/",
        title:
          "L3從台灣到矽谷、中東她們推動全球女性職涯發展",
        contents:
          "即便現今社會強調兩性平權，但女性職場的友善環境仍有改善空間，其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人其中，為女性科技人提供創業平台的WeTogether創辦人石舫亘，是一位職業婦女和母親，為了開創夢想從眾人稱羨的矽谷打包回台；而為中東難民與受壓迫女性創造工作機會的，為了實踐夢想遠走陌生異鄉。",
      },
    ],
  },
]

const SlidersSection = () => {
  return (
    <>
      <SliderFirst topTopics={topicsData[0].top} bottomTopics={topicsData[0].bottom}  />
      <SliderSecond topTopics={topicsData[1].top} bottomTopics={topicsData[1].bottom} />
      <SliderFirst topTopics={topicsData[2].top} bottomTopics={topicsData[2].bottom} />
    </>
  );
};

export default SlidersSection;
